; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 428240 2 1 3 5 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	spectrograph1 - mode
	thermograph2 - mode
	spectrograph0 - mode
	Star1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star0 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
)
(:goal (and
	(pointing satellite1 Planet8)
	(have_image Planet5 spectrograph1)
	(have_image Phenomenon6 spectrograph0)
	(have_image Star7 spectrograph1)
	(have_image Planet8 spectrograph0)
	(have_image Phenomenon9 thermograph2)
	(have_image Phenomenon10 spectrograph0)
))

)

; plan
1. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 7
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 7
3. (turn_to satellite0 star7 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 star7)
   goals met: 0 of 7
4. (turn_to satellite1 star0 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star0)
   goals met: 0 of 7
5. (calibrate satellite1 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 7
6. (turn_to satellite0 star0 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star0)
   goals met: 0 of 7
7. (turn_to satellite1 planet8 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet8)
   goals met: 1 of 7
8. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 1 of 7
9. (take_image satellite1 planet8 instrument1 spectrograph0)
   added: (have_image planet8 spectrograph0)
   goals met: 2 of 7
10. (turn_to satellite0 star7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star7)
   goals met: 2 of 7
11. (take_image satellite0 star7 instrument0 spectrograph1)
   added: (have_image star7 spectrograph1)
   goals met: 3 of 7
12. (turn_to satellite1 phenomenon6 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 phenomenon6)
   goals met: 2 of 7
13. (turn_to satellite0 planet5 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet5)
   goals met: 2 of 7
14. (take_image satellite1 phenomenon6 instrument1 spectrograph0)
   added: (have_image phenomenon6 spectrograph0)
   goals met: 3 of 7
15. (take_image satellite0 planet5 instrument0 spectrograph1)
   added: (have_image planet5 spectrograph1)
   goals met: 4 of 7
16. (turn_to satellite1 planet8 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 planet8)
   goals met: 5 of 7
17. (turn_to satellite0 phenomenon9 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon9)
   goals met: 5 of 7
18. (turn_to satellite1 phenomenon10 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 phenomenon10)
   goals met: 4 of 7
19. (take_image satellite0 phenomenon9 instrument0 thermograph2)
   added: (have_image phenomenon9 thermograph2)
   goals met: 5 of 7
20. (take_image satellite1 phenomenon10 instrument1 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 6 of 7
21. (turn_to satellite1 planet8 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet8)
   goals met: 7 of 7
